#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-XBKMxmeB3TZsK4Xe

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.acm_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:542829616420:certificate/4c805131-a0d6-4d27-8b87-e88afb2ab35e]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
aws_route53_zone.philward_io_zone: Refreshing state... [id=Z003529526RCV8G5J1PS7]
data.aws_route53_zone.philward_io_zone: Reading...
aws_route53domains_registered_domain.philward_io_domain: Refreshing state... [id=philward.io]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_route53_zone.philward_io_zone: Read complete after 1s [id=Z003529526RCV8G5J1PS7]
aws_route53_record.acm_validation_record["*.philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]
aws_route53_record.root_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_resume.philward.io_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E5CPX462LFNKX"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ response_headers_policy_id = "eaab4381-ed33-4a86-88ca-d9558dc6cd63" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_policy" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "resume-site-headers-policy"

      + cors_config {
          + access_control_allow_credentials = false
          + origin_override                  = true

          + access_control_allow_headers {
              + items = [
                  + "*",
                ]
            }

          + access_control_allow_methods {
              + items = [
                  + "GET",
                  + "HEAD",
                ]
            }

          + access_control_allow_origins {
              + items = [
                  + "*",
                ]
            }

          + access_control_expose_headers {
              + items = [
                  + "*",
                ]
            }
        }

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "default-src 'none'; img-src 'self'; script-src 'self'; style-src 'self'"
              + override                = true
            }

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "SAMEORIGIN"
              + override     = true
            }

          + referrer_policy {
              + override        = true
              + referrer_policy = "strict-origin-when-cross-origin"
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + override                   = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*